tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/fluidisedBed/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// momentumSource
// {
// 	type            phaseMeanVelocityForce;
//     active          on;            //on/off switch
//     selectionMode   all;
//     fields          (U.air);
//     alphaName       alpha.air;
//     rhoName         thermo:rho.air;
//     Ubar		    (0 0 1);
//     relaxation      0.5;                    // Optional relaxation factor
// }


// ************************************************************************* //
