tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/fluidisedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles 0
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
);

regions
(
    boxToCell
    {
        box (-0.075 0 -1) (0.075 0.5 1);

        fieldValues
        (
            volScalarFieldValue alpha.air 0.45
            volScalarFieldValue alpha.particles     0.18
            volScalarFieldValue alpha.particles1    0.19
            volScalarFieldValue alpha.particles2    0.18
        );
    }
);


// ************************************************************************* //
